In [2]:
# 1.1.1	DataFrames Creation
#############################

In [5]:
import pandas as pd
list_of_nums = [[1,2,3,4],
                [5,6,7,8],
                [9,10,11,12],
                [13,14,15,16],
                [17,18,19,20]]
df = pd.DataFrame(list_of_nums)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [7]:
df = pd.DataFrame(
    list_of_nums, 
    index = ["1->", "2->", "3->", "4->", "5->"], 
    columns = ["A", "B", "C", "D"]
)
df

      A   B   C   D
1->   1   2   3   4
2->   5   6   7   8
3->   9  10  11  12
4->  13  14  15  16
5->  17  18  19  20

In [8]:
import numpy as np
numpy_array = np.array([[1,2,3,4],
                        [5,6,7,8],
                        [9,10,11,12],
                        [13,15,16,16],
                        [17,18,19,20]])
df = pd.DataFrame(numpy_array)
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  15  16  16
4  17  18  19  20

In [9]:
# 1.1.5	Using Column as Row Index in DF
###################################################

In [14]:
df = pd.DataFrame([['red', 11], ['white', 22], ['blue', 
                           33], ['maroon', 44], ['black', 55]], columns=["colors", "values"])
df

   colors  values
0     red      11
1   white      22
2    blue      33
3  maroon      44
4   black      55

In [15]:
df.set_index('values')

        colors
values
11         red
22       white
33        blue
44      maroon
55       black

In [16]:
df.set_index("colors")

        values
colors
red         11
white       22
blue        33
maroon      44
black       55

In [17]:
df['shade'] = pd.Series(
                       ['light', 'dark', 'medium', 'dark', 'light']
                       )

In [18]:
df

   colors  values   shade
0     red      11   light
1   white      22    dark
2    blue      33  medium
3  maroon      44    dark
4   black      55   light

In [19]:
df.set_index(["colors","values"])

                shade
colors values
red    11       light
white  22        dark
blue   33      medium
maroon 44        dark
black  55       light

In [20]:
# 1.1.6	Selective Columns Load in Pandas Dataframe
#####################################################

In [22]:
new_df = pd.DataFrame(df, columns=["colors", "shade"])
new_df

   colors   shade
0     red   light
1   white    dark
2    blue  medium
3  maroon    dark
4   black   light

In [23]:
# 1.1.8	Mathematical Operations in DataFrames
################################################

In [24]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randint(1,100,size=(5, 5)))
df

    0   1   2   3   4
0  38  95  40  73  12
1  18  91  74  15  98
2  93  65  84  44  66
3  13  73  93  57  12
4  77  42  87  33  43

In [25]:
df * df

      0     1     2     3     4
0  1444  9025  1600  5329   144
1   324  8281  5476   225  9604
2  8649  4225  7056  1936  4356
3   169  5329  8649  3249   144
4  5929  1764  7569  1089  1849

In [26]:
df*10

     0    1    2    3    4
0  380  950  400  730  120
1  180  910  740  150  980
2  930  650  840  440  660
3  130  730  930  570  120
4  770  420  870  330  430

In [27]:
df + 100

     0    1    2    3    4
0  138  195  140  173  112
1  118  191  174  115  198
2  193  165  184  144  166
3  113  173  193  157  112
4  177  142  187  133  143

In [28]:
df & 0

   0  1  2  3  4
0  0  0  0  0  0
1  0  0  0  0  0
2  0  0  0  0  0
3  0  0  0  0  0
4  0  0  0  0  0

In [29]:
# 1.1.12	Using Series to Create DataFrames
################################################

In [30]:
idx_series = pd.Series([10, 25, 93, 400, 5000], 
              index =["mark", "robert", "cane", "abel", "lucifer"])

In [32]:
df_from_series = pd.DataFrame([idx_series])
df_from_series

   mark  robert  cane  abel  lucifer
0    10      25    93   400     5000

In [33]:
df_from_series = pd.DataFrame(idx_series)
df_from_series

            0
mark       10
robert     25
cane       93
abel      400
lucifer  5000

In [35]:
# 1.1.13	Using Dicts to Create DataFrames
##############################################

In [36]:
sample_dict = {'a': 1, 'b': 2, 'c': 3}
df = pd.DataFrame([sample_dict])
df

   a  b  c
0  1  2  3

In [38]:
df = pd.DataFrame([sample_dict, sample_dict], 
                            index=['Row1', 'Row2'])
df

      a  b  c
Row1  1  2  3
Row2  1  2  3

In [39]:
# 1.1.16	Configurations, Options & Settings at Startup
###########################################################

In [40]:
import pandas as pd

def start():
    options = {
        'display': {
            'max_columns': None,         # Maximum number of columns in DF
            'max_colwidth': 25,          # Maximum width of columns
            'expand_frame_repr': False,  # Don't wrap to multiple pages
            'max_rows': 14,              # How many max rows to handle 
            'max_seq_items': 50,         # Max length of printed sequence
            'precision': 4,              # Floating point precision
            'show_dimensions': False     # Control if rows x columns is shown
        },
        'mode': {
            'chained_assignment': None   # Controls SettingWithCopyWarning
        }
    }

    for category, option in options.items():
        for op, value in option.items():
            pd.set_option(f'{category}.{op}', value)  # Python 3.6+

start()
del start  # Clean up namespace for the interpreter

In [41]:
pd.__name__

'pandas'

In [42]:
pd.get_option('display.max_rows')

14

In [45]:
url = ('https://archive.ics.uci.edu/ml/'
       'machine-learning-databases/abalone/abalone.data')
cols = ['sex', 'height', 'weight', 'length', 'diam', 'rings']
abalone = pd.read_csv(url, usecols=[0, 1, 2, 3, 4, 8], names=cols)
abalone

     sex  height  weight  length    diam  rings
0      M   0.455   0.365   0.095  0.5140     15
1      M   0.350   0.265   0.090  0.2255      7
2      F   0.530   0.420   0.135  0.6770      9
3      M   0.440   0.365   0.125  0.5160     10
4      I   0.330   0.255   0.080  0.2050      7
...   ..     ...     ...     ...     ...    ...
4172   F   0.565   0.450   0.165  0.8870     11
4173   M   0.590   0.440   0.135  0.9660     10
4174   M   0.600   0.475   0.205  1.1760      9
4175   F   0.625   0.485   0.150  1.0945     10
4176   M   0.710   0.555   0.195  1.9485     12

In [46]:
# 1.1.17	Using Pandasâ€™ Testing Module for Sample Data Structures
#####################################################################

In [47]:
import pandas.util.testing as tm
tm.N, tm.K = 15, 3

import numpy as np
np.random.seed(444)
tm.makeTimeDataFrame(freq='M').head()

<ipython-input-47-ff3fd639804c>:1: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

                 A       B       C       D
2000-01-31  0.3574  0.2669  0.3537 -0.5366
2000-02-29  0.3775 -0.4803 -0.4339 -0.8868
2000-03-31  1.3823  0.3008 -0.4980  0.1071
2000-04-30  1.1755 -0.1791  0.2288 -0.7409
2000-05-31 -0.9393  1.1837 -0.6501 -0.0757

In [48]:
tm.makeDataFrame().head()

                 A       B       C       D
b8jgVbQbug -0.7485 -0.0995 -0.0601  0.0353
OKCyyhkEvY  0.4984  0.7983 -0.1694 -1.4875
RtcTWq0AMT -0.1482  0.5077 -0.0895 -0.7168
vtdamOujY0 -0.3487  0.2739  1.5519 -0.0545
tW49Zqe3lC  0.1618  0.8398  0.6907  1.5360

In [49]:
[i for i in dir(tm) if i.startswith('is')]

['is_bool',
 'is_categorical_dtype',
 'is_datetime64_dtype',
 'is_datetime64tz_dtype',
 'is_extension_array_dtype',
 'is_interval_dtype',
 'is_number',
 'is_numeric_dtype',
 'is_period_dtype',
 'is_sequence',
 'is_timedelta64_dtype']

In [50]:
# 1.1.18	Using Accessor Methods
########################################

In [51]:
pd.Series._accessors

{'cat', 'dt', 'sparse', 'str'}

In [52]:
address = pd.Series([
         'Seattle, D.C. 12345',
         'Brooklyn, NY 12346-1755',
         'Palo Alto, CA 58131',
         'Redmond, CA 98123'
    ])

In [53]:
address.str.upper()

0        SEATTLE, D.C. 12345
1    BROOKLYN, NY 12346-1755
2        PALO ALTO, CA 58131
3          REDMOND, CA 98123
dtype: object

In [54]:
address.str.count(r'\d')  # 5 or 9-digit zip?

0    5
1    9
2    5
3    5
dtype: int64

In [56]:
regex = (r'(?P<city>[A-Za-z ]+), '   # One or more letters
             r'(?P<state>[A-Z]{2}) '      # 2 capital letters
             r'(?P<zip>\d{5}(?:-\d{4})?)')  # Optional 4-digit
address.str.replace('.', '').str.extract(regex)

        city state         zip
0    Seattle    DC       12345
1   Brooklyn    NY  12346-1755
2  Palo Alto    CA       58131
3    Redmond    CA       98123

In [57]:
datering = pd.Series(pd.date_range('2015', periods=9, freq='Q'))

In [58]:
datering

0   2015-03-31
1   2015-06-30
2   2015-09-30
3   2015-12-31
4   2016-03-31
5   2016-06-30
6   2016-09-30
7   2016-12-31
8   2017-03-31
dtype: datetime64[ns]

In [59]:
datering.dt.day_name()

0      Tuesday
1      Tuesday
2    Wednesday
3     Thursday
4     Thursday
5     Thursday
6       Friday
7     Saturday
8       Friday
dtype: object

In [60]:
datering[datering.dt.quarter > 2]

2   2015-09-30
3   2015-12-31
6   2016-09-30
7   2016-12-31
dtype: datetime64[ns]

In [61]:
datering[datering.dt.is_year_end]

3   2015-12-31
7   2016-12-31
dtype: datetime64[ns]

In [62]:
# 1.1.19	DatetimeIndex from Component Columns
#################################################

In [63]:
from itertools import product
datecols = ['year', 'month', 'day']
df = pd.DataFrame(list(product([2019, 2020], [1, 2], [1, 2, 3])), columns=datecols)
df['data'] = np.random.randn(len(df))
df

    year  month  day    data
0   2019      1    1 -0.2611
1   2019      1    2  0.0288
2   2019      1    3  0.1224
3   2019      2    1 -0.4383
4   2019      2    2  0.6121
5   2019      2    3 -2.5061
6   2020      1    1 -1.0402
7   2020      1    2 -0.9675
8   2020      1    3  0.5950
9   2020      2    1  0.8734
10  2020      2    2 -0.8927
11  2020      2    3  2.1961

In [64]:
df.index = pd.to_datetime(df[datecols])
df.head()

            year  month  day    data
2019-01-01  2019      1    1 -0.2611
2019-01-02  2019      1    2  0.0288
2019-01-03  2019      1    3  0.1224
2019-02-01  2019      2    1 -0.4383
2019-02-02  2019      2    2  0.6121

In [65]:
df = df.drop(datecols, axis=1).squeeze()
df.head()

2019-01-01   -0.2611
2019-01-02    0.0288
2019-01-03    0.1224
2019-02-01   -0.4383
2019-02-02    0.6121
Name: data, dtype: float64

In [66]:
df.index.dtype.name

'datetime64[ns]'

In [67]:
# 1.1.20	Using Categorical Data for Time and Space Optimization
####################################################################

In [68]:
import pandas as pd
colors = pd.Series([
    'periwinkle',
    'mint green',
    'burnt orange',
    'periwinkle',
    'burnt orange'])

import sys
colors.apply(sys.getsizeof)

0    59
1    59
2    61
3    59
4    61
dtype: int64

In [69]:
mapper = {v: k for k, v in enumerate(colors.unique())}
mapper

{'periwinkle': 0, 'mint green': 1, 'burnt orange': 2}

In [70]:
as_int = colors.map(mapper)
as_int

0    0
1    1
2    2
3    0
4    2
dtype: int64

In [71]:
as_int.apply(sys.getsizeof)

0    24
1    28
2    28
3    24
4    28
dtype: int64

In [72]:
cat_colors = colors.astype('category')
cat_colors.cat.categories

Index(['burnt orange', 'mint green', 'periwinkle'], dtype='object')

In [73]:
cat_colors.cat.codes

0    2
1    1
2    0
3    2
4    0
dtype: int8

In [74]:
# 1.1.22	Membership Binning Mapping Trick
##############################################

In [75]:
countries = pd.Series([
      'United States',
      'Canada',
      'Mexico',
      'Belgium',
      'United Kingdom',
      'Thailand'])

groups = {
    'North America': ('United States', 'Canada', 'Mexico', 'Greenland'),
    'Europe': ('France', 'Germany', 'United Kingdom', 'Belgium')
}
countries

0     United States
1            Canada
2            Mexico
3           Belgium
4    United Kingdom
5          Thailand
dtype: object

In [77]:
from typing import Any
def membership_map(s: pd.Series, groups: dict,
                   fillvalue: Any=-1) -> pd.Series:
    # Reverse & expand the dictionary key-value pairs
    groups = {x: k for k, v in groups.items() for x in v}
    return s.map(groups).fillna(fillvalue)

In [78]:
membership_map(countries, groups, fillvalue='other')

0    North America
1    North America
2    North America
3           Europe
4           Europe
5            other
dtype: object

In [79]:
groups = dict(enumerate(('ab', 'cd', 'xyz')))
{x: k for k, v in groups.items() for x in v}

{'a': 0, 'b': 0, 'c': 1, 'd': 1, 'x': 2, 'y': 2, 'z': 2}

In [107]:
data = np.random.randn(100, 4)
df = pd.DataFrame(data, columns=['a', 'b', 'c', 'd'])
data = np.random.randn(100, 4)
df2 = pd.DataFrame(data, columns=['a', 'b', 'c', 'd'])

In [109]:
df

         a       b       c       d
0  -0.5801 -0.3423 -2.2820  1.2328
1   0.1213 -0.5310 -1.5045  0.1575
2   0.0016 -1.0671  1.3912  0.4672
3   1.0443  0.7148  0.2570  0.4059
4   0.1035 -0.0376  0.3676  0.4878
..     ...     ...     ...     ...
95  0.1377  0.5073  1.2660 -1.7746
96  0.5851 -0.7094  0.0576  1.1638
97 -0.2652  2.2475  0.8200  0.3512
98 -0.9315  1.7852 -0.3590  0.5212
99 -0.3792  0.5405 -0.1321  0.2691

In [112]:
%%timeit
df*df2

355 Âµs Â± 68.6 Âµs per loop (mean Â± std. dev. of 7 runs, 1000 loops each)

In [113]:
%%timeit
df.multiply(df2)

296 Âµs Â± 42.4 Âµs per loop (mean Â± std. dev. of 7 runs, 1000 loops each)

In [115]:
%%timeit
np.multiply(df, df2)

120 Âµs Â± 4.11 Âµs per loop (mean Â± std. dev. of 7 runs, 10000 loops each)